

#---------------------------------------请根据需求调整参数-------------------------------------------------------

# 股票代码列表
stk_ls = []

# 商品期货品种列表
# cmdty_future_ls = ["A","AG","AL","AP","AU","B","BU","C","CF","CJ","CS","CU",
#                 "EB","EG","FB","FG","FU","HC","I","J","JD","JM","L","LU","M",
#                 "MA","NI","NR","OI","P","PB","PG","PP","RB","RM","RS","RU","SA",
#                 "SC","SF","SM","SN","SP","SR","SS","T","TA","TF","TS","UR","V",
#                 "WR","Y","ZC","ZN"]
cmdty_future_ls = ["A","AG", "AL"]


#股指期货代码列表
stk_idx_future_ls = ["IC","IF","IH"]

# 趋势度计算周期， 支持格式: '%{x}min' 和 'D'
cycle_trend = '2min'  

# 趋势度回溯长度
N_trend = 200 

# 单品种波动率计算周期， 支持格式:'%{x}min' 和 'D'
cycle_vol = '2min'

# 单品种波动率回溯长度
N_vol = 200

# 全商品波动率计算周期，支持格式: '%{x}min' 和 'D'
cycle_whl = 'D'

#全商品波动率回溯长度的乘数
N_mlty = 60







# ---------------------------------------下面的不用修改--------------------------------------------------------


# 期货名字字典
future_name_dict = {
    "A": "一号大豆",
    "AG":"银",
    "AL":"铝",
    "AP":"苹果",
    "AU":"黄金",
    "B":"二号大豆",
    "BB":"胶板",
    "BU":"沥青",
    "C":"玉米",
    "CF":"棉花",
    "CJ":"红枣",
    "CS":"玉米淀粉",
    "CU":"铜",
    "EB":"苯乙烯",
    "EG":"乙二醇",
    "FB":"纤板",
    "FG":"玻璃",
    "FU":"燃料油",
    "HC":"热轧卷板",
    "I":"铁矿石",
    "IC":"中证500",
    "IF":"沪深300",
    "IH":"上证50",
    "J":"焦炭",
    "JD":"鸡蛋",
    "JM":"焦煤",
    "L":"塑料",
    "LU":"低硫燃料油",
    "M":"豆粕",
    "MA":"甲醇",
    "NI":"镍",
    "NR":"20号胶",
    "OI":"菜籽油",
    "P":"棕榈油",
    "PB":"铅",
    "PG":"苹果",
    "PP":"聚丙烯",
    "RB":"螺纹钢",
    "RM":"菜籽粕",
    "RS":"油菜籽",
    "RU":"天然橡胶",
    "SA":"纯碱",
    "SC":"原油",
    "SF":"硅铁",
    "SM":"锰硅",
    "SN":"锡",
    "SP":"纸浆",
    "SR":"白糖",
    "SS":"不锈钢",
    "T":"十年国债",
    "TA":"pta(精对苯二甲酸)",
    "TF":"五年国债",
    "TS":"二年国债",
    "UR":"尿素",
    "V":"聚氯乙烯",
    "WR":"线材",
    "Y":"豆油",
    "ZC":"动力煤",
    "ZN":"锌",
    }